---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.RotationAngle
source: html/528a3269-03d1-ebc8-c83b-f72ae11b80b9.htm
---
# Autodesk.Revit.DB.SpecTypeId.RotationAngle Property

Rotation Angle, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId RotationAngle { get; }
```